{
  "id": "C150",
  "product_id": "C150",
  "name": "C150 – CA COMPLIANT CONTACT ADHESIVE",
  "full_name": "C150 – CA COMPLIANT CONTACT ADHESIVE",
  "description": "ForzaBOND™ C150 is a quick tack, sprayable adhesive formulated for bonding polystyrene foam to itself and various other substrates.",
  "brand": "forza_bond",
  "category": "BOND",
  "industry": "industrial_industry",
  "chemistry": "",
  "url": "https://forzabuilt.com/product/c150-ca-compliant-contact-adhesive/",
  "image": "https://forzabuilt.com/wp-content/uploads/2023/12/C150-CA-COMPLIANT-HIGH-SOLIDS-CONTACT-ADHESIVE.png",
  "images": [
    "https://forzabuilt.com/wp-content/uploads/2023/12/C150-CA-COMPLIANT-HIGH-SOLIDS-CONTACT-ADHESIVE.png"
  ],
  "applications": [
    "Bonds polystyrene foam to itself and many other substrates",
    "Used in refrigerator and freezer applications to bond foam on interior, non-load bearing sandwich panels",
    "Used to bond precut foam to cardboard in fabrication of insulated shipping cartons",
    "Used for preformed pipe insulation and the bonding of foam on prefabricated pump houses, animal shelters and farm waterers"
  ],
  "benefits": [
    "Quick tack",
    "Prevents attack of polystyrene foam, yet still creates a strong contact-like bond to many substrates",
    "Excellent water and moisture resistance"
  ],
  "howToUse": [
    "Be sure all surfaces are clean and free of grease, dirt, dust, etc.",
    "Apply to both surfaces to be bonded by brushing, rolling or spraying.",
    "Allow adhesive to dry, (until non-transferable to finger) then bond under pressure.",
    "When brushing, multiple coats may be required on porous surfaces.",
    "When spraying, use of DeVilbiss JGA gun with FX tip and needle or Binks 2001 or 95 gun and 63B tip 2nd needle or similar equipment is satisfactory.",
    "Adhesive should be applied at a minimum of 2.0 dry grams per square foot.",
    "Apply pressure with a hand laminate roller or nip roller.",
    "Bonds should be made as soon as practical.",
    "If adhesive is left to dry for over 30 minutes, parts should be recoated.",
    "Normal coverage required with spray pattern is approximately 80%; however, porous surfaces may need a second coat.",
    "Initial bond is strong enough to allow cutting or trimming immediately although ultimate strength is achieved in 1-3 days.",
    "If spray tip clogs, unscrew the spray tip from the gun and clean with water or a mild solvent."
  ],
  "sizing": [
    "1 Gallon Pail",
    "5 Gallon Pail",
    "55 Gallon Drum"
  ],
  "technical": [],
  "scrapedAt": "2025-10-24T17:03:16.363Z",
  "published": false,
  "notes": "Scraped from WordPress Elementor site - needs review and technical data"
}