{
  "id": "R529",
  "product_id": "R529",
  "name": "R529 – STRUCTURAL ANCHORING EPOXY",
  "full_name": "R529 – STRUCTURAL ANCHORING EPOXY",
  "description": "ForzaBOND™ R529 anchor system is a pure epoxy mortar with ETA-option 1 approval, for use in cracked and untracked concrete and is approved to the highest international standards.",
  "brand": "forza_bond",
  "category": "BOND",
  "industry": "construction_industry",
  "chemistry": "Epoxy",
  "url": "https://forzabuilt.com/product/r529/",
  "image": "https://forzabuilt.com/wp-content/uploads/2023/12/R529-Structural-Adhesive-.png",
  "images": [
    "https://forzabuilt.com/wp-content/uploads/2023/12/R529-Structural-Adhesive-.png"
  ],
  "applications": [
    "R529 is a two-component high-strength epoxy adhesive anchoring system designed for bonding steel elements or post-installing reinforcement bars to cracked and untracked concrete.",
    "Ideal for installation in dry, wet and water filled holes",
    "Approved for overhead applications",
    "Approved for diamond drilled holes for C20 to C60 concrete"
  ],
  "benefits": [
    "Fast Curing Times.",
    "Long Shelf Life – 24 month shelf life for longevity.",
    "Extensive Range – Wide range of steel element diameter and embedment depths.",
    "Easy to Use – Simple installation with low odour formula and long working times.",
    "ETA Option 1 approved"
  ],
  "howToUse": [
    "Using the proper drill bit size, drill a hole into the base material to the required depth.",
    "Blow the hole clean using a hand pump or compressed air 2 times minimum.",
    "Brush the hold with the proper wire brush 2 times minimum.",
    "Blow the hole clean using a hand pump or compressed air 2 times minimum.",
    "After dispensing a minimum of 3 stroked, fill the hole up to approximately 2/3 with adhesive.",
    "Push the steel element into the hole while turning slightly.",
    "Allow adhesive to cure for the time specified for the actual concrete temperature."
  ],
  "sizing": [
    "Cartridge",
    "2 Component",
    "More upon request"
  ],
  "technical": [],
  "scrapedAt": "2025-10-24T17:02:54.775Z",
  "published": false,
  "notes": "Scraped from WordPress Elementor site - needs review and technical data"
}