{
  "id": "T350",
  "product_id": "T350",
  "name": "T350 – THERMAL BREAK TAPE",
  "full_name": "T350 – THERMAL BREAK TAPE",
  "description": "ForzaTAPE™ T350 is a polyethylene foam tape coated with high-tack rubber adhesive.",
  "brand": "forza_tape",
  "category": "TAPE",
  "industry": "insulation_industry",
  "chemistry": "",
  "url": "https://forzabuilt.com/product/t350/",
  "image": "https://forzabuilt.com/wp-content/uploads/2023/06/T600-Foam-Bonding-Tape.png",
  "images": [
    "https://forzabuilt.com/wp-content/uploads/2023/06/T600-Foam-Bonding-Tape.png"
  ],
  "applications": [
    "Excellent adhesion",
    "High impact resistance and noise reduction, reducing vibration."
  ],
  "benefits": [
    "The polyethylene foam tape is coated with a high tack rubber adhesive, ensuring a strong and immediate bond upon application.",
    "This adhesive offers exceptional gripping power, making it perfect for applications where secure adhesion is crucial.",
    "The polyethylene foam provides excellent cushioning and impact resistance, protecting surfaces from damage and reducing noise and vibration.",
    "The foam tape is designed for easy and hassle-free application.",
    "The combination of polyethylene foam and high tack rubber adhesive results in a durable and reliable tape. It can withstand various environmental conditions, including temperature changes, moisture, and UV exposure, without losing its adhesive properties or degrading over time."
  ],
  "howToUse": [
    "Apply to the part to be bonded, ensuring that no air is trapped between the tape and the substrate.",
    "Surfaces should be clean and free of dirt, oil, frost etc. Stated temperatures are a suggested range and products may be applied at higher or lower temperatures.",
    "Remove the release liner and apply with care to the part to be bonded, ensuring that no air is trapped between the tape and the substrate.",
    "Apply with recommended application pressure of 15 pounds per inch of tape width. At the point of final assembly or lamination, remove the release liner and apply with care to avoid wrinkles or trapped air.",
    "It is recommended that end user test for suitability in their environment."
  ],
  "sizing": [
    ".18 x 3 x 1000",
    ".125 x 3 x 100",
    ".25 x 3 x 100",
    ".125 x 2 x 100",
    ".25 x 3 x 50"
  ],
  "technical": [],
  "scrapedAt": "2025-10-24T17:03:02.267Z",
  "published": false,
  "notes": "Scraped from WordPress Elementor site - needs review and technical data"
}