[
  {
    "product_code": "IC934",
    "url": "https://forzabuilt.com/product/ic934/",
    "title": "IC934 – STYRENE SAFE PRESSURE SENSITIVE ADHESIVE",
    "description": "ForzaBOND™ IC934 is an aggressive and fast-drying pressure-sensitive adhesive designed to bond to a vast range of substrates and maintain tackiness.",
    "applications": "IC934 is a web spray adhesive designed for use in applications using the substrates listed.",
    "benefits": "• Very fast drying\n• Long lasting high tack (pressure sensitive)\n• Moisture and weather-resistant bond\n• Will not attack polystyrene\n• Full strength achieved in 24 hours\n• No ODS (ozone depleting substances)",
    "how_to_use": "• IC934 is designed as a portable, self-contained spray system for field or shop applications.\n• Apply adhesive to both surfaces to be mated, at 80% to 100% coverage.\n• Allow enough time (2-4 minutes or until dry to the touch) for the adhesive to become tacky before bonding.\n• Parts should be mated with as much pressure as practical.\n• Normal coverage required with web spray pattern is approximately 80%; however, porous surfaces may need a second coat. Initial bond is strong enough to allow cutting or trimming immediately, although ultimate strength is achieved in 24 hours.\n• Canister system will spray adequately above 60º F. Canister system should be kept in warm area. In the event that the canister gets abnormally chilled, freezes or gives poor or sputtering spray, it should be warmed up before continued usage. Warming canister by immersion in warm water is recommended.\n• Notice!!! Do not store at temperatures over 120º F.",
    "sizing": "• 13oz Aerosol Can\n• 22L Canister\n• 108L Canister"
  },
  {
    "product_code": "IC933",
    "url": "https://forzabuilt.com/product/ic933/",
    "title": "IC933 – CA COMPLIANT HIGH-STRENGTH CONTACT ADHESIVE",
    "applications": "ForzaBOND™ IC933 is a Low VOC, CA Compliant Multi-Purpose, Contact Adhesive.",
    "benefits": "• Excellent bonding to porous substrates\n• Aggressive – adheres to nearly any surface\n• Good heat resistance (up to 180°F/82°C)\n• High-strength, long-term bond\n• Strong initial bond\n• Low VOC California Compliant (SCAQMD Rule 1168)",
    "how_to_use": "• Designed as a portable, self-contained spray system for field or shop applications.\n• Be sure all surfaces are clean and free of grease, dirt, dust, etc.\n• Apply adhesive to both surfaces to be mated, at 80% to 100% coverage.\n• Allow enough time (2-4 minutes or until dry to the touch) for the adhesive to become tacky before bonding.\n• Parts should be mated with as much pressure as practical.\n• Normal coverage required with web spray pattern is approximately 80%; however, porous surfaces may need a second coat.\n• Initial bond is strong enough to allow cutting or trimming immediately, although ultimate strength is achieved in approximately 1 day.",
    "sizing": "• 13oz Aerosol Can\n• 22L Disposable Canister\n• 108L Returnable Canister\n• 5 Gal Pail\n• 55 Gal Drum"
  },
  {
    "product_code": "OS2",
    "url": "https://forzabuilt.com/product/os2/",
    "title": "OS2 – MULTI-PURPOSE HYBRID POLYMER SEALANT",
    "description": "ForzaSEAL™ OS2 is a non-hazardous, moisture-cure sealant.",
    "applications": "• Bond a large variety of materials including concrete, brick, aluminum, brass, steel, glass, granite, wood and many plastics\n• Permanently flexible and durable\n• Polystyrene foam board safe",
    "benefits": "• Retains strong bond through impact, peel, flex and changing temperature\n• Easily apply by extrusion or trowel\n• Non-yellowing\n• Does not form bubbles, shrink or crack\n• Highly weather resistant\n• Immediately paintable applications\n• Semi Self-Leveling\n• Low temperature flexibility (properties retained to -75° F)\n• High UV resistance\n• Doesn’t attract dust or dirt",
    "how_to_use": "• ForzaSEAL™® OS2 is generally applied by extrusion, trowel.\n• Surfaces should be clean and free of dust, oil and grease.\n• Aluminum and other metals may be primed for best adhesion.\n• Apply between 34°and 150°F, in damp or dry conditions.\n• The majority of its strength is developed in the first 24 hours.\n• Minimum cure time is over night, but several days may be required for maximum performance, however cure time may be accelerated at higher temperatures (do not exceed 150°F for accelerated cure).\n• Most parts do not require clamping, although heavy parts may require temporary clamping to ensure desired positioning.\n• Easy clean up with wet rag or mineral spirits.",
    "sizing": "• 10.1 oz Cartridge\n• 20 oz Sausage\n• 28 oz Cartridge\n• 5 Gallon Pail\n• 52 Gallon Drum"
  },
  {
    "product_code": "T215",
    "url": "https://forzabuilt.com/product/t215/",
    "title": "T215 – ULTRA HIGH-BOND ACRYLIC FOAM TAPE",
    "description": "ForzaTAPE™® T215 is a high bond, double-coated foam tape with an acrylic adhesive.",
    "applications": "• Bonds a wide variety of materials where permanent flexibility is needed, including plastics, metals and glass\n• Bonds parts where static load is high in the transportation, electronics, advertising, hardware and construction industries\n• Use in conjunction with Forza S228 to see best resutls.",
    "benefits": "• .045″ Thick Foam\n• Can withstand a wide range of weathering and temperature conditions without losing adhesion\n• Replaces screw, riveting and welding\n• High strength bond resists moisture, chemicals, dust and UV\n• Very flexible, with elongation rate of 800%\n• Instant high strength; bonds well to many surfaces\n• Maintains adhesion at subzero temperatures\n• Long aging, resists hardening or embrittlement\n• Flexible and compressible\n• Shockproof and soundproof characteristics",
    "how_to_use": "• Ensure substrate is clean and dry, and free from dust, dirt, oil, wax or silicone.\n• For best results, use of Forzabond primer to clean surface and promote adhesion is recommended.\n• Apply to the part to be bonded, ensuring that no air is trapped between the tape and the substrate.\n• Apply with recommended application pressure of 15 pounds per inch of tape width.\n• At the point of final assembly or lamination, remove the release liner and apply with care to avoid wrinkles or trapped air.\n• Recommended application temperature to achieve best results is 65°F or above.\n• Apply adequate pressure using a J roller.",
    "sizing": "• .25 x 108\n• .75 x 108\n• .375 x 108\n• 1 x 108\n• 1.5 x 108\n• 2 x 108\n• 3.125 x 108\n• Custom Sizes Available"
  },
  {
    "product_code": "OA4",
    "url": "https://forzabuilt.com/product/oa4/",
    "title": "OA4 – HYBRID POLYMER ADHESIVE/SEALANT",
    "description": "ForzaBOND™ OA4 is a non-hazardous, high-strength, single-part moisture cure adhesive.",
    "applications": "• Bond a large variety of materials including aluminum, brass, steel, glass, granite, wood, and many plastics\n• Permanently flexible\n• Structural bonding",
    "benefits": "• Retains strong bond through impact, peel, flex and changing temperatures\n• Easy apply by extrusion, or trowel\n• Non-yellowing\n• Does not form bubbles, shrink or crack\n• Highly weather resistant\n• Can be painted in most applications\n• Low-temperature flexibility (properties retained to -75° F)\n• Meets or exceeds ASTM Standards D412, D1002, D794, G26\n• High strength",
    "how_to_use": "• Forzabond® OA4 is generally applied by extrusion, and trowel. Surfaces should be clean and free of dust, oil, and grease.\n• Apply between 34°and 150°F, in damp or dry conditions. The majority of its strength is developed in the first 24 hours.\n• Minimum cure time is overnight, but several days may be required for maximum performance, however cure time may be accelerated at higher temperatures (do not exceed 150°F for accelerated cure).\n• Most parts do not require fixturing, although heavy parts may require temporary clamping to ensure desired positioning.",
    "sizing": "• 10.1 oz Cartridge\n• 20 oz Sausage\n• 28 oz Cartridge\n• 5 Gallon Pail\n• 52 Gallon Drum"
  }
]